{"191bfc5f-ee47-45b7-913a-14637f8534a7":{"name":"BepisPlugins","description":"A collection of essential BepInEx plugins for Koikatu / Koikatsu Party, EmotionCreators, AI-Shoujo / AI-Girl, HoneySelect2 and other games by Illusion"},"ad005b57-2640-476f-8255-caed7680b3e3":{"name":"Modding API for Illusion games","description":"This is an API designed to make writing plugins for recent UnityEngine games made by the company Illusion easier and less bug-prone. It abstracts away a lot of the complexity of hooking the game save/load logic, creating interface elements at runtime, and many other tasks. All this while supplying many useful methods and tools"},"166243fc-f6a8-4f9d-8121-0e373d6495db":{"name":"PovX","description":"PoV plugin"},"e89bbd92-df1b-4e9e-add4-292dda4b2292":{"name":"BepInEx","description":"Bepis Injector Extensible"},"8d62c33d-97a1-4d6d-bc52-798b0a895032":{"name":"BepInEx.ConfigurationManager","description":"Mod configuration manager for BepInEx 5"},"23104d56-579c-45cf-88dd-9c4e618c169c":{"name":"IPALoaderX","description":"IPALoaderX is a plugin for BepInEx that allows to load plugins made for Illusion Plugin Architecture without installing it"},"98d785a7-68ca-48d5-b986-f445f0b7ef27":{"name":"EnableFullScreenToggle","description":"Enables toggling full screen with alt\u002Benter on games with it disabled"},"228263f0-ff01-4cde-8ddd-fbde23da90bc":{"name":"EnableResize","description":"Enable window resizing. Must be enabled in the plugin config either by editing the plugin\u0027s .cfg file or by using ConfigurationManager"},"f853e45b-6624-4e97-b5db-43e04801eb2e":{"name":"InputHotkeyBlock","description":"Prevents plugin hotkeys from triggering while typing in an input field"},"c32495d7-fbcd-4691-8a69-5be22a909d35":{"name":"MessageCenter","description":"A simple plugin that shows any log entries marked as \u0022Message\u0022 on screen. Plugins generally use the \u0022Message\u0022 log level for things that they want the user to read"},"7e92bde0-779f-4730-9511-63c04b4fc563":{"name":"MuteInBackground","description":"Adds an option to mute a game when it loses focus, i.e. when alt-tabbed. Must be enabled in the plugin config either by editing the plugin\u0027s .cfg file or by using ConfigurationManager"},"a4ed82cd-d06e-4691-a2a3-88153cfbd729":{"name":"OptimizeIMGUI","description":"Reduce unnecessary GC allocations of Unity\u0027s IMGUI (OnGUI) interface system. It fixes the passive GC allocations that happen every frame caused by using any OnGUI code at all, and reduces GC allocations for OnGUI code"},"c85f38bc-8723-4816-9aa3-3ec477853140":{"name":"DemystifyExceptions","description":"Turns exceptions into a more readable format. Resolves enumerators, lambdas and other complex structures"},"28b15d81-ba13-413c-8290-3d9d6997aa55":{"name":"MirrorInternalLogs","description":"This preloader patcher allows to capture and mirror Unity internal debug logs (i.e. the contents of output_log.txt)"},"a0cf9a40-500d-406e-90be-c0f83177ed1e":{"name":"ScriptEngine","description":"Loads and reloads BepInEx plugins from the BepInEx\\scripts folder. User can reload all of these plugins by pressing the keyboard shortcut defined in the config. Shortcut is F6 by default"},"6a94d7e0-1070-4507-8ed3-92b884364c28":{"name":"Simple Mono Profiler","description":"A simple profiler that can be used in any Unity player build as long as it can run BepInEx 5.x. It can generate a .csv file with profiling results from an arbitrary length of time"},"dcb8723b-f5b1-4ee6-afdc-e4fcb4895411":{"name":"Startup Profiler","description":"Log and report the time spent in the Start, Awake, Main, .ctor and .cctor methods of each plugin"}}